<script setup>
import Op from '@/uikit/Options.vue';
import Info from '@/uikit/Info.vue';
</script>

<template>

<hr>

<!------------------------------------------------------------->
<h4>Особенности для всех Continuous</h4>
<!------------------------------------------------------------->

<h5>1. Если из одного слога и заканчивается на согласный, то удваивается</h5>
<ul>
    <li>Н-р слово <em>cut</em></li>
    <li><i>He is cut<u>ting</u></i></li>
</ul>

<h5>2. Глагол To Be</h5>
<ul>
    <li>Глагол To Be: <em>Am</em> / <em>Is</em> / <em>Are</em> используется как вспомогательные глагол (не переводится)</li>
    <li>Не используется в прямом значении, а для основного глагола указывается окончание ing</li>
    <li>🅾️ <i>I am being sad</i> (я грустный) - нельзя сказать</li>
    <li>✅ <i>I am sad</i> - можно сказать только в Present Simple</li>
</ul>

<h5>3. Modals Verb (Can, Must, May) не используются</h5>
<ul>
    <li>🅾️ <i>I am musting go</i></li>
    <li>✅ <i>I must go</i> (Present Simple)</li>
</ul>

<h5>4. Глаголы, которые не используются во всех Continuous</h5>
<ul>
    <li><em>like</em></li>
    <li><em>hate</em></li>
    <li><em>promise</em></li>
    <li><em>believe</em></li>
    <li>etc.</li>
</ul>

</template>
